#pragma once

// Adapted from: https://github.com/ggml-org/llama.cpp/blob/master/ggml/src/ggml-common.h (MIT License)

#ifdef __CUDA_ARCH__
    #include <cuda_fp16.h>
    using half_t = half;
    #define CONSTANT static constexpr __device__

#else
    #include <ATen/ATen.h>
    using half_t = at::Half;
    #define CONSTANT static constexpr
#endif

#include <cstdint>

// move these into the global namespace out of convenience
using std::int8_t;
using std::int16_t;
using std::int32_t;
using std::int64_t;
using std::uint8_t;
using std::uint16_t;
using std::uint32_t;
using std::uint64_t;

// NOTE: sometimes llama-cpp will change things on their end
// Discrepancy will cause errors... Is there a better way to deal w this?
enum class GGMLQuantizationType : int {
    F32     = 0,
    F16     = 1,
    Q4_0    = 2,
    Q4_1    = 3,
    Q5_0    = 6,
    Q5_1    = 7,
    Q8_0    = 8,
    Q2_K    = 10,
    Q3_K    = 11,
    Q4_K    = 12,
    Q5_K    = 13,
    Q6_K    = 14,
    Q8_K    = 15,
    IQ2_XXS = 16,
    IQ2_XS  = 17,
    IQ3_XXS = 18,
    IQ1_S   = 19,
    IQ4_NL  = 20,
    IQ3_S   = 21,
    IQ2_S   = 22,
    IQ4_XS  = 23,
    I8      = 24,
    I16     = 25,
    I32     = 26,
    I64     = 27,
    F64     = 28,
    IQ1_M   = 29,
    BF16    = 30,
    TQ1_0   = 34,
    TQ2_0   = 35,
    MXFP4   = 39
};

// here, "qtype" just means GGMLQuantizationType
inline bool is_valid_qtype(int qtype_int) {
    switch (qtype_int) {
        case 0: case 1: case 2: case 3: 
        case 6: case 7: case 8: case 10:
        case 11: case 12: case 13: case 14:
        case 15: case 16: case 17: case 18:
        case 19: case 20: case 21: case 22:
        case 23: case 24: case 25: case 26:
        case 27: case 28: case 29: case 30:
        case 34: case 35: case 39:
            return true;
        default:
            return false;
    }
}

// QK = number of values after dequantization
// QK_K = super-block size

constexpr int QK_K = 256;
constexpr int K_SCALE_SIZE = 12;

constexpr int QK4_0 = 32;
struct block_q4_0 {
    half_t d;           // delta
    uint8_t qs[QK4_0 / 2]; // nibbles / quants
};
static_assert(sizeof(block_q4_0) == sizeof(half_t) + QK4_0 / 2, "wrong q4_0 block size/padding");

constexpr int QK4_1 = 32;
struct block_q4_1 {
    half_t d; // delta
    half_t m; // min
    uint8_t qs[QK4_1 / 2]; // nibbles / quants
};
static_assert(sizeof(block_q4_1) == 2 * sizeof(half_t) + QK4_1 / 2, "wrong q4_1 block size/padding");

constexpr int QK_MXFP4 = 32;
struct block_mxfp4 {
    uint8_t e; // E8M0
    uint8_t qs[QK_MXFP4/2];
};
static_assert(sizeof(block_mxfp4) == sizeof(uint8_t) + QK_MXFP4/2, "wrong mxfp4 block size/padding");

constexpr int QK5_0 = 32;
struct block_q5_0 {
    half_t d;           // delta
    uint8_t qh[4];         // 5-th bit of quants
    uint8_t qs[QK5_0 / 2]; // nibbles / quants
};
static_assert(sizeof(block_q5_0) == sizeof(half_t) + sizeof(uint32_t) + QK5_0 / 2, "wrong q5_0 block size/padding");

constexpr int QK5_1 = 32;
struct block_q5_1 {
    half_t d; // delta
    half_t m; // min
    uint8_t qh[4];         // 5-th bit of quants
    uint8_t qs[QK5_1 / 2]; // nibbles / quants
};
static_assert(sizeof(block_q5_1) == 2 * sizeof(half_t) + sizeof(uint32_t) + QK5_1 / 2, "wrong q5_1 block size/padding");

constexpr int QK8_0 = 32;
struct block_q8_0 {
    half_t d;       // delta
    int8_t  qs[QK8_0]; // quants
};
static_assert(sizeof(block_q8_0) == sizeof(half_t) + QK8_0, "wrong q8_0 block size/padding");

constexpr int QK8_1 = 32;
struct block_q8_1 {
    half_t d; // delta
    half_t s; // d * sum(qs[i])
    int8_t qs[QK8_1]; // quants
};
static_assert(sizeof(block_q8_1) == 2*sizeof(half_t) + QK8_1, "wrong q8_1 block size/padding");

//
// Ternary quantization
//

// 1.6875 bpw
struct block_tq1_0 {
    uint8_t qs[(QK_K - 4 * QK_K / 64) / 5]; // 5 elements per byte (3^5 = 243 < 256)
    uint8_t qh[QK_K/64]; // 4 elements per byte
    half_t d;
};
static_assert(sizeof(block_tq1_0) == sizeof(half_t) + QK_K / 64 + (QK_K - 4 * QK_K / 64) / 5, "wrong tq1_0 block size/padding");

// 2.0625 bpw
struct block_tq2_0 {
    uint8_t qs[QK_K/4]; // 2 bits per element
    half_t d;
};
static_assert(sizeof(block_tq2_0) == sizeof(half_t) + QK_K / 4, "wrong tq2_0 block size/padding");

//
// Super-block quantization structures
//

// 2-bit quantization
// weight is represented as x = a * q + b
// 16 blocks of 16 elements each
// Effectively 2.625 bits per weight
struct block_q2_K {
    uint8_t scales[QK_K/16]; // scales and mins, quantized with 4 bits
    uint8_t qs[QK_K/4];      // quants
    half_t d;    // super-block scale for quantized scales
    half_t dmin; // super-block scale for quantized mins
};
static_assert(sizeof(block_q2_K) == 2*sizeof(half_t) + QK_K/16 + QK_K/4, "wrong q2_K block size/padding");

// 3-bit quantization
// weight is represented as x = a * q
// 16 blocks of 16 elements each
// Effectively 3.4375 bits per weight
struct block_q3_K {
    uint8_t hmask[QK_K/8]; // quants - high bit
    uint8_t qs[QK_K/4];    // quants - low 2 bits
    uint8_t scales[12];    // scales, quantized with 6 bits
    half_t d;           // super-block scale
};
static_assert(sizeof(block_q3_K) == sizeof(half_t) + QK_K / 4 + QK_K / 8 + 12, "wrong q3_K block size/padding");

// 4-bit quantization
// 8 blocks of 32 elements each
// weight is represented as x = a * q + b
// Effectively 4.5 bits per weight
struct block_q4_K {
    half_t d;    // super-block scale for quantized scales
    half_t dmin; // super-block scale for quantized mins
    uint8_t scales[K_SCALE_SIZE]; // scales and mins, quantized with 6 bits
    uint8_t qs[QK_K/2];           // 4--bit quants
};
static_assert(sizeof(block_q4_K) == 2*sizeof(half_t) + K_SCALE_SIZE + QK_K/2, "wrong q4_K block size/padding");

// 5-bit quantization
// 8 blocks of 32 elements each
// weight is represented as x = a * q + b
// Effectively 5.5 bits per weight
struct block_q5_K {
    half_t d;    // super-block scale for quantized scales
    half_t dmin; // super-block scale for quantized mins
    uint8_t scales[K_SCALE_SIZE]; // scales and mins, quantized with 6 bits
    uint8_t qh[QK_K/8];           // quants, high bit
    uint8_t qs[QK_K/2];           // quants, low 4 bits
};
static_assert(sizeof(block_q5_K) == 2*sizeof(half_t) + K_SCALE_SIZE + QK_K/2 + QK_K/8, "wrong q5_K block size/padding");

// 6-bit quantization
// weight is represented as x = a * q
// 16 blocks of 16 elements each
// Effectively 6.5625 bits per weight
struct block_q6_K {
    uint8_t ql[QK_K/2];      // quants, lower 4 bits
    uint8_t qh[QK_K/4];      // quants, upper 2 bits
    int8_t  scales[QK_K/16]; // scales, quantized with 8 bits
    half_t d;             // super-block scale
};
static_assert(sizeof(block_q6_K) == sizeof(half_t) + QK_K / 16 + 3*QK_K/4, "wrong q6_K block size/padding");

// This is only used for intermediate quantization and dot products
struct block_q8_K {
    float   d;              // delta
    int8_t  qs[QK_K];       // quants
    int16_t bsums[QK_K/16]; // sum of quants in groups of 16
};
static_assert(sizeof(block_q8_K) == sizeof(float) + QK_K + QK_K/16*sizeof(int16_t), "wrong q8_K block size/padding");

// (Almost) "true" 2-bit quantization.
